[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
!
#
$
%
&
'
(
)
*
+
,
-
.
/
0
1
2
3
4
5
6
7
8
9
:
;
=
?
@
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
X
Y
Z
[
\
]
^
_
`
a
b
c
d
e
f
g
h
i
j
k
l
m
n
o
p
q
r
s
t
u
v
w
x
y
z
{
|
}
~
ª
»
##1
##0
##4
##6
##3
##8
##7
##2
##5
##9
##43
##19
##85
##15
##70
##62
##79
##10
##60
##89
##82
##13
##63
##42
##65
##40
##73
##49
##12
##45
##69
##83
##75
##72
##80
##61
##55
##67
##29
##30
##68
##20
##48
##41
##47
##39
##50
##59
##18
##23
##17
##53
##88
##77
##22
##09
##66
##44
##99
##11
##33
##00
##52
##87
##46
##32
##90
##78
##64
##81
##71
##25
##35
##03
##93
##02
##16
##14
##76
##86
##92
##74
##84
##05
##95
99
59
89
69
49
80
29
79
39
10
19
90
60
20
70
30
40
50
73
53
43
93
13
63
83
23
22
52
62
32
92
42
12
82
33
72
##57
##58
##51
##56
##54
85
35
15
55
95
25
45
65
75
17
57
97
27
47
67
37
87
77
58
98
38
88
28
18
78
48
68
71
21
81
11
51
91
61
41
31
86
76
36
26
64
66
96
54
34
94
84
16
46
44
14
56
24
74
##21
##24
##27
##26
##37
##36
##38
##34
##31
##28
##08
##98
##06
##97
##01
##04
##94
##91
##07
##96
##650
##139
##700
##659
##109
##629
##859
##729
##439
##690
##150
##759
##639
##450
##699
##199
##459
##799
##129
##499
##850
##829
##400
##490
##159
##820
##429
##653
##830
##809
##839
##100
##420
##600
##890
##620
##430
##192
##790
##893
##130
##120
##190
##102
##720
##709
##730
##800
##609
##750
##623
##693
##739
##630
##123
##193
##899
##409
##152
##702
##132
##493
##792
##432
##122
##622
##793
##433
##892
##423
##422
##402
##153
##852
##603
##633
##452
##833
##435
##703
##802
##602
##822
##652
##853
##195
##632
##732
##722
##803
##855
##453
##103
##823
##492
##692
##733
##723
##495
##605
##825
##795
##403
##752
##832
##805
##155
##133
##725
##735
##753
##625
##405
##105
##425
##655
##895
##835
##755
##695
##455
##125
##705
##635
##135
##698
##797
##657
##617
##627
##417
##471
##191
##737
##127
##677
##858
##897
##898
##477
##687
##707
##757
##157
##798
##628
##828
##827
##808
##457
##427
##807
##438
##197
##137
##128
##618
##437
##857
##487
##838
##481
##497
##121
##727
##488
##431
##658
##691
##607
##131
##408
##611
##158
##108
##638
##407
##498
##671
##458
##891
##151
##608
##697
##851
##651
##107
##401
##688
##731
##601
##637
##406
##738
##678
##418
##621
##791
##138
##837
##451
##728
##801
##708
##486
##701
##421
##681
##198
##491
##721
##626
##494
##411
##434
##624
##821
##428
##616
##478
##636
##751
##631
##604
##426
##656
##474
##896
##404
##831
##436
##826
##454
##606
##614
##706
##824
##101
##136
##496
##754
##856
##756
##416
##734
##834
##758
##674
##794
##684
##736
##894
##424
##194
##724
##676
##634
##704
##106
##694
##654
##476
##686
##154
##836
##124
##104
##726
##196
##796
##156
##126
##484
##806
##414
##854
##456
##804
##134
##696
##666
##446
##664
##444
##177
##464
##187
##188
##178
955
129
##181
829
420
750
430
629
250
755
199
220
239
820
399
455
920
120
299
709
930
##186
759
320
550
109
609
699
##171
155
355
655
899
939
##176
130
459
599
630
739
150
730
855
350
650
450
409
529
159
229
539
950
429
929
959
499
555
530
230
329
859
620
209
309
439
509
999
255
659
639
809
359
520
909
830
330
139
##184
559
729
259
850
339
720
799
839
##233
##232
##174
##111
##887
##777
200
##878
##533
##114
900
##778
##888
##116
##771
##881
600
##235
##532
700
##871
100
##222
500
800
##776
400
300
##886
##535
##225
##525
##874
##876
##884
690
390
##774
490
590
##781
990
##786
190
##714
290
333
933
433
790
133
##814
##716
##784
833
533
890
##816
633
733
233
##325
##237
##238
##231
##227
##527
##537
##538
##521
##234
##528
##228
##236
##221
##531
##526
##226
##224
##328
##524
##536
##327
##534
##358
##357
##257
##258
##251
##321
##037
##937
##351
##256
202
##356
##057
##254
592
##938
602
##326
##957
292
802
502
##058
##031
302
392
702
##354
992
##051
692
792
##038
402
##324
492
892
102
192
##958
210
##931
440
##951
289
615
983
902
970
##056
279
985
843
389
342
572
580
863
883
163
685
645
##034
165
562
719
143
113
275
460
543
575
889
813
##036
245
315
313
365
610
115
270
212
283
443
410
542
842
969
189
373
482
565
640
119
219
310
369
383
760
712
845
972
265
480
589
660
943
179
260
362
360
375
560
649
885
912
215
272
470
473
515
582
573
549
710
862
810
269
280
485
483
519
545
679
780
875
919
989
965
##936
##956
173
263
379
363
463
465
510
745
913
183
249
319
413
445
469
540
675
819
860
942
940
262
475
579
513
583
643
673
715
779
740
773
980
182
385
345
380
662
612
683
763
869
##954
243
343
340
462
682
882
873
##934
##054
149
613
770
789
772
880
170
570
663
680
713
742
962
162
242
349
585
783
110
140
145
273
849
213
412
669
973
142
175
180
785
765
840
982
945
185
240
415
442
512
619
775
489
563
762
815
915
312
670
672
749
812
949
169
372
872
285
479
782
870
569
910
975
172
642
743
879
665
979
960
963
382
689
282
419
449
370
865
472
769
160
112
653
953
623
353
823
923
723
153
253
223
553
753
853
##296
453
622
123
523
423
##300
##390
##200
##209
323
122
722
##299
##398
232
##304
##306
322
922
##297
##204
##205
##394
##303
##203
##293
##298
822
803
##302
752
##290
222
##294
##301
##308
##399
152
693
493
893
##206
##392
522
303
393
552
532
903
##309
##391
##396
##395
432
503
##393
193
703
##295
##208
##397
203
632
##307
103
993
132
##292
##207
932
##305
##202
252
403
652
352
593
422
603
##291
952
##598
332
##554
##504
##201
793
832
##502
##505
452
852
##506
##592
##595
##551
##556
##555
##509
##591
##597
732
##590
##508
##594
##559
##507
##503
##596
##599
##552
##501
##593
293
935
##553
205
##550
##500
305
635
795
##557
405
995
425
595
905
325
505
695
735
895
835
805
435
125
235
335
##558
105
535
135
525
195
495
705
925
225
295
725
395
605
825
625
148
667
768
848
167
367
488
668
688
977
561
517
##338
168
448
541
767
347
747
861
918
917
267
661
647
948
161
241
277
377
467
568
641
348
567
518
867
761
717
147
117
318
577
847
261
248
841
961
967
##337
461
468
718
817
218
548
648
677
868
618
788
188
268
368
418
588
748
507
928
828
388
477
911
697
177
288
361
741
888
##090
##334
##336
247
217
317
617
857
968
##331
307
537
441
411
547
808
738
278
417
818
##332
837
428
387
777
698
947
807
397
108
787
987
##333
437
527
827
141
447
##094
##095
##335
707
137
237
328
341
611
988
208
937
138
638
927
727
457
451
757
##091
227
257
858
941
##099
408
427
118
357
587
957
101
908
608
207
378
657
##098
708
637
327
151
211
487
478
687
781
877
971
997
597
691
497
298
797
301
731
238
528
311
458
658
811
998
197
251
471
578
571
297
128
721
187
678
846
##096
##093
498
398
907
521
338
287
407
631
627
121
127
111
181
258
308
508
538
434
931
557
711
771
751
887
978
701
737
131
321
178
511
958
897
107
431
628
337
381
581
598
491
231
228
351
866
996
898
607
501
371
358
758
##008
801
291
391
401
438
938
728
171
158
614
844
871
851
##000
791
206
221
281
481
981
891
796
531
286
474
558
876
951
##021
694
906
601
831
838
157
976
198
734
621
724
576
586
806
901
136
331
344
314
551
644
681
616
651
778
754
878
964
##005
896
636
926
266
274
414
784
696
904
324
421
114
544
556
854
986
956
##001
991
736
524
144
116
271
416
484
516
574
714
966
994
106
201
306
934
236
226
921
126
826
374
664
816
##097
##006
191
704
406
924
334
166
384
446
671
684
881
##092
##026
##924
798
104
534
536
634
836
316
356
354
464
914
##996
##993
296
936
186
174
244
656
776
974
##004
591
394
336
184
366
466
476
584
646
676
674
766
756
##903
##028
794
424
164
176
214
444
746
856
##997
##999
396
526
624
276
256
346
666
686
874
946
954
##002
494
804
606
204
436
824
146
216
254
##003
##007
594
821
726
376
456
566
744
774
864
194
604
506
326
284
364
454
716
786
##991
##992
##901
234
154
546
814
886
##990
##994
##024
##927
496
404
426
944
894
224
124
156
386
##908
294
706
304
626
486
884
984
##906
##907
196
246
264
916
##902
##921
564
554
654
764
##998
##904
##027
596
834
##905
514
##928
134
##926
##995
504
##447
##768
##112
##718
##115
##482
##472
##441
##466
##644
##419
##413
##480
##870
##875
##848
##782
##161
##144
##465
##661
##646
##882
##865
##873
##883
##872
##868
##743
##710
##741
##162
##146
##685
##662
##843
##819
##842
##789
##765
##740
##142
##169
##141
##479
##460
##468
##810
##863
##812
##880
##712
##745
##767
##717
##788
##787
##119
##113
##164
##443
##440
##670
##613
##672
##849
##818
##749
##780
##761
##711
##179
##183
##118
##489
##463
##442
##445
##483
##448
##645
##885
##860
##841
##846
##785
##766
##172
##470
##667
##862
##840
##877
##779
##760
##773
##772
##185
##140
##168
##147
##462
##467
##619
##665
##649
##641
##889
##813
##847
##864
##719
##763
##764
##170
##163
##173
##175
##485
##449
##412
##469
##610
##642
##612
##669
##762
##713
##742
##744
##746
##182
##145
##180
##148
##415
##475
##679
##640
##683
##879
##845
##844
##715
##783
##748
##160
##165
##149
##117
##461
##615
##668
##867
##817
##866
##769
##775
##747
##166
##410
##682
##673
##648
##389
##861
##811
##770
##587
##110
##660
##343
##361
##869
##143
##680
##375
##189
##473
##643
##689
##663
##369
##372
##244
##579
##675
##647
##243
##285
##242
##216
##214
##585
##546
6959
4913
2815
7863
2449
##373
##376
##374
##270
##211
##589
##513
##583
##577
##578
8370
4239
2715
##167
##315
##368
##320
##352
##289
##263
##229
##230
##247
##246
##264
##529
##588
9979
5940
2943
2915
2982
3913
6059
7082
4075
6362
8279
7243
8510
8572
5773
8663
9473
5663
##346
##314
##815
##267
##288
##573
##545
##544
##574
9985
8939
2963
2965
9029
6060
6082
2063
2012
3049
5329
4330
8389
2240
6210
6265
6220
9219
4243
1549
6572
4760
6745
3860
3845
2140
8173
1143
1110
5110
4175
7642
2672
6419
6485
6642
9613
5443
1462
1442
##319
##340
##345
##383
##380
##318
##322
##316
##215
##210
##261
##271
##276
##286
##582
##542
##567
##530
##539
##522
##571
9940
8989
4940
4930
7963
9060
6062
2060
7089
5049
5345
9363
2265
5259
6219
6282
3210
3240
1279
8283
3355
3350
7249
8545
3585
3580
5575
2579
2545
4570
6579
6565
7539
1760
5762
5713
9743
9719
9740
6769
8762
9840
2873
7813
6885
7160
7175
8180
1189
9119
9185
8679
8665
3660
3665
6443
6460
6640
3462
8462
5610
##378
##381
##213
##240
##570
##563
##580
##564
5960
5959
8949
4972
4955
8040
8029
1013
1930
9015
9075
6069
2009
7070
7029
3042
4083
7319
7339
7350
7359
5379
5363
1382
8343
2310
2285
5220
6249
3265
3229
3239
9279
4285
1220
8229
8230
7242
8513
8563
8569
3543
3569
5530
9515
4582
6562
6575
7575
1742
5785
5745
2770
2779
4779
3742
8770
7715
7782
7783
9843
9885
9889
8810
2880
4842
6860
7112
8169
9110
6185
4113
8649
7619
2613
6675
9643
3440
9470
9445
8470
1675
4675
4472
##385
##310
##349
##312
##386
##265
##275
##248
##239
##278
##281
##512
##561
##547
9910
9959
5970
5930
5939
8920
6915
6970
6969
8069
7980
7950
3919
3963
3983
3930
1019
1010
1030
1955
9070
9083
6070
6030
6050
5062
7379
7340
5343
5313
5320
5359
4370
4340
9342
9372
1330
6385
2312
2345
2260
5269
6230
3215
3282
4279
1210
1239
8270
8249
8220
3343
8542
1543
1575
1530
5579
9560
9542
9545
4560
4573
7542
7572
5743
9715
9742
2785
4715
3762
3749
7769
5885
5863
9862
3812
8860
2885
2869
1819
1862
7873
4873
7179
2185
2173
8149
1179
1175
5182
5172
9165
9140
6175
8660
8682
8683
3613
2619
2662
9612
3412
8443
1670
1660
1640
4665
4480
1443
1482
2470
2460
##360
##363
##365
##341
##339
##260
##280
##220
##253
##274
##543
##519
##510
##540
##569
##541
##517
##514
##586
9919
9982
9913
9963
5962
5972
8970
8960
8963
8942
8940
8909
6913
6949
4929
8010
8012
8009
2960
2949
2950
7970
7989
3939
1043
1919
1979
9020
6042
2050
7043
7079
3055
4062
4060
4072
7310
7313
7383
7380
5319
5365
5373
5375
5372
4360
4373
4312
9370
9389
9375
1342
6379
6340
6339
8310
2385
2313
2369
2210
2229
5240
5229
6255
3219
3285
3263
3249
9249
4213
4242
4269
1272
1259
8219
3363
3365
7270
7210
8530
3562
3563
1515
1565
5570
5583
5572
5529
9519
9583
2519
2549
4515
4542
9779
9765
4743
4713
6775
6772
3719
3782
8785
8760
8765
7785
5810
5860
5883
9849
9845
8873
2842
1882
1840
1883
7810
7872
4869
6840
6875
7115
7113
2170
8165
1162
1113
6169
4170
4172
8615
8689
8672
7669
3642
3675
6413
6469
6649
9665
5482
3489
3469
8419
8485
8440
1612
4670
4460
2480
##382
##342
##329
##348
##323
##366
##311
##387
##262
##273
##249
##241
##259
##560
##565
##523
##511
9955
9929
9930
5929
8955
8930
6940
6973
6945
4970
4962
4920
8073
8080
7943
7942
7949
7929
3982
3973
3909
1079
1083
1985
1970
1960
1949
1975
1972
1959
9085
9049
9045
9055
9039
6015
6009
2019
2030
2020
7010
7060
7042
7040
7083
3043
3013
4015
4010
4012
5030
5020
7389
7342
7375
5310
5360
4313
4345
4359
9343
9319
9379
9349
9330
1310
1365
1345
1383
1359
6319
8362
8365
8312
8345
8372
8330
2315
2362
2382
2243
2289
2273
5230
5250
6285
6273
6229
6259
3260
3280
3259
9273
4212
1215
1262
1229
1250
3349
3369
7229
7220
8519
8515
8570
8589
8565
8512
8529
8539
1579
5519
5560
5540
5539
9562
9512
9569
4519
4520
6563
1719
1715
1770
1782
1765
1773
1783
1772
9782
2719
2742
4770
4782
6773
3770
3789
3772
8712
7770
7742
5873
9813
3815
3842
8819
2810
2813
2863
7860
6870
6862
6880
2162
2182
2169
8145
5119
5113
9143
6170
6140
6145
6180
4163
3179
3182
3165
3175
8619
8670
7685
7615
6415
6410
6619
6670
9660
9649
5470
5479
5489
3415
3483
9440
9472
9480
8442
1662
4679
4415
4462
4410
4449
1445
1475
5670
5645
2465
2473
##362
##353
##388
##364
##219
##212
##272
##277
##549
##575
##572
##581
##516
##6140
##6870
9943
9975
9972
5915
5989
5982
5945
8915
8910
8969
6972
6920
4910
4912
4983
8085
8070
8082
8075
8059
2919
2989
2969
2955
7972
7955
3979
3965
3980
1085
1063
1045
1943
1982
6079
6089
6075
6072
6029
2010
2049
2069
2083
7012
7020
3083
4019
4063
4049
4069
4020
4039
5013
5072
5050
7363
5342
5350
9382
9380
9329
1349
1380
1320
1339
6382
6375
6372
6320
6359
8340
8373
8375
2329
2339
2213
2255
5219
5260
5282
5212
6243
6260
6239
6250
3289
3273
9213
9245
9275
9220
4260
4283
4280
4230
1283
8240
8245
3360
3373
7239
3542
3549
3529
1519
1585
1510
1539
5542
9589
9513
2539
4513
4529
6560
6589
6573
7519
7579
1749
5760
5789
5775
9775
2763
4742
6743
6762
3779
8710
8783
5879
5880
9870
9860
9872
3863
8843
8812
8869
2865
2845
1815
1879
1810
7889
7882
7865
4870
6865
7143
2143
2119
2115
2145
8185
8115
8183
1145
1183
5115
9113
9149
4119
4160
4183
3143
8685
8645
7663
7640
7672
7680
2682
2663
2640
6440
6473
6673
6669
9645
5462
5410
5413
5463
5442
5465
5445
3443
9410
9460
9412
8489
8465
8480
1680
4643
4689
4663
4443
4469
1410
5682
5669
7415
##370
##313
##355
##279
##282
##269
##268
##223
##287
##520
##566
##576
##6174
##4886
9962
9942
9980
5949
5950
5909
8913
8972
6943
6985
6979
6960
6982
6930
4985
4942
8015
8045
8039
2962
2913
7975
7959
3915
3912
3975
3959
1015
1049
1055
1009
1913
1980
1920
1909
9019
9012
9009
6073
6055
2043
2015
2070
2079
7063
3085
3079
3060
3082
3075
3072
3080
3009
4055
4029
4059
5079
5029
7315
7382
7345
7329
5385
4343
4379
4382
4383
4380
4350
9355
1313
6343
6363
8349
8355
8359
2370
2363
2365
2219
2262
2239
5243
5213
5275
6270
6263
6240
6245
3279
3269
3275
9212
9255
4219
4245
4220
1270
1263
1245
1255
8212
8259
3315
3340
7289
7265
7273
7245
8562
8549
8575
8580
3582
1570
1589
1542
1520
5585
5515
5520
9510
9582
9540
9580
2570
2560
2569
2572
2529
4563
4583
4530
6549
7543
7540
1743
5770
5749
9785
2743
2760
2713
2783
2772
4763
4765
4712
4745
6760
6763
6742
6783
3773
3780
8763
8742
8775
7745
5840
5875
9819
9879
9873
3879
3865
8885
8879
8842
8845
8883
2889
7885
7869
4843
4810
4865
6879
6813
7119
7185
7162
7189
7142
7149
7145
7172
2160
2189
2183
2175
8110
8182
8163
8112
1170
1112
1172
5163
5173
9173
9112
6143
6162
6110
6163
4185
4149
3145
3180
8640
8612
7643
7682
7613
3689
3682
3645
3680
2643
2679
2665
2649
2683
6462
6442
6412
6445
6475
6610
6660
9662
9673
5440
3419
3479
3460
3442
3449
9489
8482
8413
1619
1610
1642
1669
4485
4465
1479
5615
5689
5665
2479
2442
2469
7410
7413
7473
##013
##069
##077
##330
##317
##245
##255
##218
##518
##584
##6779
##4174
9973
9909
5943
5913
5963
5912
5983
8919
8979
8973
8983
8980
4919
4965
4969
4975
8043
2939
7919
7912
7930
3970
3962
3945
3955
1062
1060
1040
1072
1080
1020
1050
1910
1989
1940
1945
1983
1929
1939
9010
9042
9080
9030
6010
6063
2013
7069
7055
4089
4065
4030
4009
5070
5042
5045
5039
7385
7362
7373
7369
7320
5382
5312
5330
5339
4315
4355
4339
9345
1340
1373
1369
1355
6313
6312
8379
8360
2343
2242
2249
2272
2280
5215
5249
5245
6262
6289
6213
6275
6280
3213
3242
3283
9285
9215
9289
9265
9250
4282
4255
1285
1289
1213
1265
1273
1212
1269
1280
8215
8260
8282
8265
3319
7219
7285
7282
8573
3515
3570
3589
3513
3573
1582
1583
1572
1529
5562
5582
9549
9575
9572
9530
9539
2543
2582
2512
2583
4562
4579
4510
4589
4540
4580
6520
7582
7563
7529
1789
1780
5710
5782
9762
9789
9713
9763
9769
2789
2740
4773
6770
6713
3713
3765
3740
8743
8745
8780
7713
7772
7780
5819
5870
9842
3810
3840
3875
3872
8870
2882
2840
1843
1812
1872
7843
7819
7870
7845
4819
4882
6819
7163
7173
7183
7180
2112
8175
1163
1142
1173
5185
5170
5142
5112
5169
5180
9170
9160
9189
9163
9169
6179
6173
6149
6172
4142
4180
3160
3163
3140
3183
8643
7610
7649
7645
7683
3619
3685
3615
3673
2610
2689
6470
6679
6613
6683
9610
9689
9669
9672
5460
3470
3413
9485
9415
9462
9449
1613
1663
1683
4615
4613
4669
4470
4482
4440
1413
1472
5679
5660
5649
2419
7463
7465
7449
7445
##377
##217
##515
##6180
##6177
##6164
##6767
##4876
##4119
##4185
##4147
##4769
##4711
##4764
9989
9949
9920
9939
5985
5975
5955
5920
8985
8982
8975
6919
6910
6942
6912
6983
6975
6980
6909
4989
4982
4980
8083
2970
2972
2930
7985
7913
7969
3949
3929
1082
1965
9043
9082
9073
6013
2042
2065
2072
2080
2059
7073
7049
3019
3062
3010
3073
3012
3050
4085
4082
4040
4080
5010
5089
5069
7343
7370
7312
5370
5340
4389
4363
4342
4375
9310
9312
9320
9350
1315
1379
1329
6370
6310
6342
6349
6383
6330
8319
8369
8329
2360
2355
2320
2279
2220
2250
5265
5283
5272
6242
6283
3255
9262
9242
9240
9269
9230
9239
9259
4215
4263
4229
1260
1249
1230
8213
8242
8250
7260
7263
8582
8540
3583
3575
1573
5543
5510
5589
5573
5512
9585
9570
2563
2580
2530
4543
4549
4539
6542
6545
6529
7515
7589
7573
7512
7580
7520
1745
5742
5765
5772
9772
2749
4775
6719
6785
6749
6780
3743
8779
8789
8740
8769
7765
7712
5882
5865
5849
5812
5869
3843
3870
3869
3880
8889
8882
2849
2812
1885
1889
1813
1880
7842
7875
4860
4849
4812
6812
6869
7110
7182
2110
2165
2172
8143
8170
1185
1149
1169
5189
5175
9175
9180
4143
4115
4110
4182
4165
4145
8673
7670
7679
7675
2675
6489
6483
6615
6662
6689
6680
9685
9640
9683
9680
5449
5412
5483
9443
9463
8460
8473
8449
8445
8483
8472
1643
1615
1672
4682
4640
4683
4463
4473
1470
1463
5643
5662
5613
5640
2412
2475
7470
7460
7489
##379
##367
##371
##252
##562
##568
##6782
##6787
##6813
##6818
##6881
##4818
##4118
##4187
##4781
9915
9970
9912
5979
5980
8943
8962
8945
8929
8959
4960
4973
4950
8019
8062
8079
8060
8072
8020
2942
2945
2959
2909
7910
7982
7983
7920
3943
3985
1070
1089
1065
1073
1069
1075
1962
9040
9069
9059
6040
6045
6080
2062
2082
2040
7019
7072
7059
7009
3015
3020
3059
4070
5085
5009
7355
5362
5383
4369
9385
9313
9340
1319
1375
6315
6360
6365
8315
8350
2379
2340
2373
2349
2383
2380
2330
2350
2282
2263
2245
2269
2230
5285
5279
5289
5263
5242
5280
6279
6269
6272
3262
3272
3250
9270
4262
4265
4273
4272
4259
8275
8272
8255
3385
7213
7240
7212
7275
7250
3579
3545
3572
3530
3539
1562
1580
9579
2515
2510
4569
4575
6510
6582
6513
6540
6569
6580
6539
7569
1785
1779
1713
1769
5719
9773
9745
4772
4780
6715
6782
6765
6712
3785
3745
8782
7740
5843
5815
5842
9815
9812
9883
3819
3889
8862
2860
1870
1863
1842
1845
4840
4845
6815
6842
7165
2113
2163
2149
2180
8162
8179
8189
1160
1182
5145
9162
9182
6113
6165
4162
3162
3142
8610
7660
3670
3669
3683
2685
2645
6482
6472
6645
6672
9663
5473
5469
3465
3480
9475
8415
1665
1645
4619
4685
4680
1412
5619
5642
2415
7443
7462
7479
7480
##020
##350
##359
##250
##548
##6167
##6748
##6860
##6871
##6814
##4847
##4163
##4167
##4146
9983
9950
5919
5942
5973
5969
8965
6963
6955
6939
6950
4943
4939
4909
8089
8013
8049
2929
7979
7940
7973
3972
3920
1029
9089
9063
9072
9050
6020
2089
2073
7015
7062
3069
3039
4079
4073
4045
5055
7372
7330
5369
5380
4362
4329
9315
9362
9360
9369
1372
6389
6380
6350
2319
2212
5273
9210
9229
4270
4240
8210
3379
3389
3345
3375
7230
8560
3519
3565
3512
1560
1513
1540
1512
1545
5513
5545
5569
4565
4512
6515
6583
6530
7585
7570
7562
7560
1710
1763
1740
5779
5712
9712
2712
4719
4740
4769
6710
3760
8719
8713
8749
7762
7760
7773
5862
5889
5845
9865
3882
3873
8849
8875
2879
2875
1865
1849
7883
4862
4813
4863
4883
6843
6863
6883
2142
8119
9179
6115
6160
6182
6142
6112
4189
4169
3110
3172
8642
8669
7689
7665
7673
7612
3643
3662
3679
3610
3649
3672
6463
6685
6665
9619
9670
9679
9682
9675
5485
5475
3473
3475
9479
9442
9469
1673
4660
4649
4672
4479
4445
4475
1419
1415
1489
2443
2462
2440
2445
2483
7419
7483
##085
##063
##059
##053
##046
##283
##266
##284
##6182
##6113
##6849
##6817
##4819
##4841
##4189
##4117
##4715
##4747
##4788
##4787
9945
8950
6929
4915
4949
8042
8055
8030
8050
2985
2912
7962
1915
1942
1912
1950
1900
6083
2075
2055
2029
7085
7075
7080
7030
3089
3029
3030
5082
5040
7360
5389
5355
4365
9365
1343
1370
1362
1389
1350
6345
6329
8313
8383
2215
2270
2283
2259
5270
5262
5255
9282
4289
4250
1282
1242
1240
8243
8289
8273
8269
3382
3383
3380
7283
7255
7259
1569
5563
5580
9563
2513
2542
2575
6585
7510
7583
1775
5715
5780
9770
9760
9749
9780
2710
2765
2745
2775
2780
4762
4789
6789
3710
3712
3769
8715
7743
5872
9810
9882
8813
8872
2862
1860
1875
7862
7840
7849
4885
4880
6810
6889
6882
7169
8160
8142
5165
5149
6119
3185
3115
3113
7662
3663
3640
3612
2670
2642
6479
6480
6682
5419
5415
3482
3445
8410
8463
8469
1685
1679
1682
1649
4612
4419
4483
1449
1483
1480
2485
2489
7482
7412
##043
##040
##012
##029
##087
##344
##384
##6162
##6110
##6169
##6178
##6184
##6780
##6766
##6774
##6810
##4815
##4877
##4160
##4175
##4166
##4178
##4181
##4116
##4785
##4742
##4768
##4771
##4716
##4774
9960
9969
5910
5900
8912
4979
4963
4945
8063
7960
7965
7945
7909
3960
3942
1042
1012
1059
1963
1973
1969
9013
6043
6019
6065
6012
6039
2039
7065
7045
7039
7050
3045
4013
5043
5015
5073
5083
4320
9373
9383
9339
8363
8342
8320
2389
2342
2375
2275
5210
3212
9243
9263
9272
4210
1243
1219
1275
8285
8239
3370
3310
3312
3329
3330
7215
7272
8585
3510
3560
9529
2573
2520
4545
7513
1762
1712
5763
5740
9783
4749
4783
3763
3783
7779
7710
7789
7763
9863
3862
3849
8863
8865
2819
1869
7815
4815
6845
6872
7140
2179
1140
1180
5143
5162
5179
5183
9183
4140
4112
3170
3149
8662
2615
2673
2612
6449
6643
6612
9615
9642
3463
3472
9482
9465
9483
8412
1689
4662
4673
4413
4412
1440
1473
1469
5675
5680
2463
2472
7440
7469
##049
##081
##035
##6149
##6172
##6176
##6785
##6763
##6773
##6775
##6772
##6747
##6788
##6873
##6847
##6811
##4812
##4883
##4872
##4866
##4844
##4113
##4188
##4177
##4184
##4773
##4783
##4761
##4746
9965
2983
2920
7915
3989
3969
3950
6085
6049
2045
4042
4050
5019
5080
7349
5315
5349
4385
4310
1360
8385
8382
8339
6212
3243
3270
3245
3220
4249
8262
8280
3342
3359
3540
1563
2585
2589
2565
2540
6570
7565
7545
4785
4710
7749
3813
8840
8880
2872
4875
6849
7170
8172
1119
9115
9145
3189
3112
3169
8613
2680
5472
1485
1460
1465
5673
5612
7475
##019
##073
##039
##050
##088
##011
##052
##032
##6170
##6163
##6168
##6144
##6116
##6186
##6712
##6741
##6711
##6882
##6842
##6861
##6867
##4867
##4878
##4881
##4143
##4179
##4110
##4111
##4741
##4448
5965
8065
1053
9065
3063
3065
7365
4319
1363
2372
2359
3230
8263
7279
8520
3520
9520
4585
4572
6519
5769
2762
2773
3775
8773
9875
2843
2870
2883
7812
4879
8113
5140
9172
6189
3119
8675
8680
2660
2669
6465
5480
3485
3410
9413
8479
8475
4489
5672
2413
7485
7442
7472
##070
##062
##089
##045
##047
##025
##6119
##6179
##6160
##6142
##6173
##6117
##6111
##6743
##6719
##6740
##6744
##6716
##6784
##6862
##6863
##6875
##6866
##6864
##4860
##4863
##4840
##4817
##4170
##4149
##4169
##4114
##4762
##4712
##4748
##4718
##4766
6989
6965
4959
2979
2910
2940
2900
7939
3910
9062
9079
2085
7013
3040
5063
5059
4349
4372
9359
6373
6215
9283
3320
3339
7262
7280
5565
9543
9573
2562
6543
6512
7549
5783
2782
2769
6779
7775
9880
3885
3883
7880
4889
8140
5160
3173
9419
4642
4645
5685
2410
2482
##079
##065
##075
##072
##030
##017
##022
##009
##071
##014
##074
##347
##978
##6143
##6189
##6112
##6188
##6166
##6187
##6710
##6713
##6777
##6786
##6869
##6880
##6848
##6841
##6887
##6878
##4869
##4874
##4115
##4142
##4165
##4112
##4161
##4141
##4144
##4164
##4171
##4749
##6667
##4466
6962
6900
2973
1039
3070
5060
1385
1312
8380
5239
9260
9280
4275
8223
8543
9565
9710
6740
3715
8815
1165
6183
6663
4610
4442
##082
##080
##061
##067
##963
##6165
##6148
##6118
##6715
##6770
##6745
##6768
##6764
##6843
##6885
##6845
##4813
##4873
##4848
##4871
##4814
##4162
##4182
##4140
##4148
##4780
##4717
##4777
##4784
3023
4043
5012
5323
4323
5253
9253
3362
3313
3372
7719
5813
1873
4872
1115
9142
4179
##015
##068
##044
##078
##076
##970
##960
##968
##923
##914
##976
##6183
##6141
##6146
##6181
##6762
##6789
##6776
##6879
##6889
##6840
##6883
##6872
##6816
##6876
##4843
##4862
##4810
##4861
##4888
##4884
##4183
##4172
##4782
##4763
##4765
##4775
##4772
##6663
##4485
##4680
5933
8023
2975
2980
2953
3900
2053
6355
8583
5549
2523
7530
8772
6873
4173
5683
##042
##083
##033
##064
##086
##948
##6115
##6145
##6147
##6171
##6742
##6765
##6717
##6781
##6771
##6714
##6819
##6844
##4870
##4882
##4845
##4875
##4887
##4864
##4186
##4719
##4770
##4779
##6664
##4615
##4682
##4642
##4672
6923
7900
3953
5075
4353
9323
6369
8353
2323
3353
7879
##010
##060
##016
##084
##959
##917
##922
##933
##932
##935
##6175
##6769
##6718
##6746
##6778
##6865
##6868
##6888
##6884
##4879
##4880
##4868
##4173
##4180
##4168
##4713
##4740
##4767
##4744
##4714
##6670
##6672
##6644
##4445
##4461
##4447
##4665
##4683
9933
5923
8053
3940
9053
9033
3053
5065
8523
5523
9869
##055
##942
##909
##966
##987
##986
##6185
##6161
##6749
##6783
##6815
##6877
##6886
##4889
##4842
##4849
##4176
##4745
##6673
##6641
##4442
##4483
##4464
##4662
##4649
##4612
##4661
##4641
##4646
8953
4033
1323
4223
8579
6523
##048
##041
##985
##979
##940
##939
##950
##6114
##6760
##6812
##6846
##4865
##4846
##4816
##4145
##4778
##4776
##4786
##6685
##6662
##6689
##6640
##6661
##6646
##4482
##4412
##4467
##4685
##4673
5953
4923
4900
5353
2223
6253
1253
3323
7269
7223
9523
##018
##943
##947
##918
##977
##944
##925
##6761
##4885
##4811
##4743
##4789
##1819
##6679
##6610
##6649
##6645
##6647
##4440
##4473
##4472
##4689
##4663
9953
4933
2933
1033
6053
7023
7053
4053
7353
3223
7253
7523
##989
##983
##955
##967
##930
##911
##900
##981
##984
##6874
##4710
##4760
##1715
##1710
##6643
##6615
##6683
##6666
##4443
##4470
##4479
##4463
##4469
##4643
##4679
##4610
##4675
##4667
9900
8933
7953
7933
7033
4253
3523
3799
##023
##066
##919
##915
##982
##913
##965
##949
##975
##961
##964
##1860
##1886
##1772
##6619
##6613
##6642
##6675
##6648
##4670
##4647
7923
2023
2033
3033
5023
5223
1223
3322
1609
2699
##912
##1842
##1865
##1812
##1845
##1711
##1776
##6665
##6669
##4415
##4462
##4460
##4465
##4475
##4660
##4613
##4669
##4644
##6468
2922
3933
1933
9023
6023
5053
8323
2253
9223
2650
2199
3139
6700
7139
7659
7499
7750
8700
8859
8699
8129
9129
##962
##910
##969
##916
##1869
##1847
##1782
##1768
##4449
##4480
##4619
##4640
##6485
##6463
##6442
##6473
9923
8922
8900
3022
4022
5033
9322
6353
3253
8253
1523
1699
1490
2450
4729
##945
##929
##920
##971
##974
##1843
##1810
##1889
##1863
##1849
##1816
##1741
##1716
##6660
##6682
##6612
##6680
##6668
##4419
##4468
##4446
##4668
8923
6953
8033
8052
3923
1953
6033
9353
6323
1859
1150
1199
1400
1120
1800
1750
2759
2400
2630
3729
3439
3829
4700
4109
4459
4739
5139
5629
5450
5620
5130
6650
7809
8829
9439
9499
9430
##1862
##1818
##1888
##1866
##1719
##1762
##1740
##1775
##1767
##1766
##1787
##1714
##4489
##4413
##4645
##4648
##6419
##6479
5922
6933
4953
2923
1923
4023
1353
1322
6223
5522
9522
2522
1650
1830
2109
2233
3659
3830
4129
5729
5199
5159
5809
5839
5790
6429
6809
7700
7690
7639
7490
8659
8739
8409
9650
9690
9699
9790
9409
##953
##988
##952
##1815
##1870
##1882
##1840
##1861
##1841
##1877
##1811
##1789
##1763
##1745
##1747
##1784
##4410
##4444
##6470
##6489
##6465
##6440
##6469
##6475
6922
4922
8032
1022
1952
6022
5022
5052
8322
8352
2353
8522
6522
7522
1759
1639
1893
1730
1899
2729
2639
2129
2609
3629
3759
3450
3100
3890
3620
3493
3603
4150
4699
4830
4730
4233
5109
5150
5459
5400
5430
5800
5423
5153
5603
6450
7759
7159
7820
8629
8729
8639
8850
8830
8120
8630
8823
9890
##973
##972
##980
##1879
##1813
##1875
##1872
##1868
##1876
##1884
##1742
##1773
##1769
##1717
##1781
##1771
##1786
##6443
##6482
##6467
8022
2932
7922
1023
1922
9022
7322
4322
3522
4523
1659
1450
1499
1420
1600
1430
2700
2659
3650
3109
3150
3400
3159
3120
4139
4859
4759
4850
4890
4750
5699
5799
5429
5890
5720
6659
6109
6430
7739
7899
8109
8439
8450
8459
8420
8720
8793
9839
9100
9630
##1848
##1844
##1874
##1770
##1760
##1713
##1749
##1783
##1761
##1718
##1774
##4441
##6413
##6449
5952
8952
7323
9352
9252
4252
1139
1700
1109
1629
1129
1850
1653
1809
1130
1709
1833
2150
2600
2720
2730
2739
2492
3690
3199
3499
3429
3809
3839
3720
3802
4650
4439
4199
4490
4820
4809
4100
4192
4130
4833
5700
5850
5600
5409
5892
6729
6439
6129
6490
6839
6790
6632
6753
7729
7699
7199
7799
7429
7420
7709
7800
7630
7793
8150
8400
8820
8429
8600
8620
8190
8800
8833
9659
9199
9159
9120
9709
9493
##941
##1873
##1817
##1864
##1881
##1780
##1764
##1143
##1119
##1173
##1117
##6462
##6445
##6483
##6461
##6466
9922
4932
1932
9032
2032
7022
4352
6252
1729
1159
1429
1839
1623
1493
2139
2499
2829
2159
2709
2122
3430
3790
3190
3709
3730
3609
3750
3739
3153
4799
4620
4733
5859
5653
5100
5709
5609
5630
5899
5495
5533
6859
6639
6699
6799
6499
6850
6890
6130
6609
6739
6899
6633
6403
6133
7859
7150
7400
7100
7600
7620
7609
7892
7603
7853
8890
8102
8603
8703
8533
8532
9629
9859
9639
9400
9632
##1883
##1880
##1867
##1814
##1743
##1785
##1748
##1744
##1746
##1161
##1111
##6460
##6412
##6448
##6441
##6447
9952
2022
5032
7352
2322
2352
3352
7252
4522
1459
1192
1790
1409
1152
1432
1892
1703
1733
1233
2859
2459
2820
2429
2653
2809
2420
2890
2430
2130
2750
2703
3129
3850
3490
3420
3432
3433
3703
3692
3723
4639
4829
4400
4429
4120
4899
4409
4622
4423
4133
5650
5659
5439
5730
5722
5492
5532
6690
6150
6720
6193
6702
6822
6652
6855
6232
6532
7109
7629
7459
7830
7890
7409
7702
7493
7122
7722
7533
8499
8490
8159
8730
8153
8802
8602
8853
8723
8232
9759
9799
9429
9653
9893
9609
9792
9153
9703
9802
9103
9233
##946
##1885
##1878
##1765
##1115
##1160
##1142
##1144
##6415
##6472
8932
6932
2952
3922
3032
5252
1439
1690
1190
1630
1622
1402
1603
1403
1805
1533
2620
2190
2102
2623
2123
2899
2852
2603
2853
3700
3639
3459
3623
3409
3132
3195
4629
4450
4159
4790
4720
4709
4623
4792
4432
4495
4705
4232
4532
5690
5129
5490
5192
5120
5190
5132
5493
5822
5753
5222
6139
6629
6759
6829
6820
6830
6420
6120
6800
6630
6493
6153
6752
7650
7450
7829
7430
7120
7730
7623
7402
7633
7723
7752
7835
8650
8139
8809
8100
8790
8130
8709
8733
8403
9729
9450
9850
9820
9809
9600
9620
9130
9190
9732
##1871
##1110
##1145
##1169
##6410
9932
6952
1032
5322
6322
1252
1799
1829
1100
1890
1620
1103
2629
2439
2839
2100
2693
2409
2423
2633
2452
2802
2103
2533
2222
3820
3653
3192
3130
3193
3899
3152
3792
3793
3423
3403
3625
4600
4893
4609
4193
4122
4402
4703
4732
4103
4222
5499
5829
5102
5739
5123
5193
5792
5122
5652
5853
5103
6400
6653
6192
6893
6730
6693
6123
6622
6423
6422
6853
7129
7839
7790
7130
7123
7833
7453
7823
7492
7733
8199
8799
8893
8750
8152
8493
8622
8195
8722
8103
8455
9139
9459
9830
9730
9800
9750
9739
9193
9122
9793
9433
9452
9195
9733
9723
9533
##1788
##1777
##1179
##1183
##1180
##1167
##1168
##1166
##6480
5932
7952
7932
7032
1352
1693
1123
1702
1792
1422
1652
1853
1195
1803
1823
1133
1232
1222
2799
2850
2830
2120
2193
2793
2892
2732
2803
2795
2895
2532
3693
3123
3833
3435
3103
3753
3233
3232
4690
4499
4420
4190
4793
4433
4892
4602
4803
4455
5759
5639
5820
5420
5750
5623
5693
5152
5622
5435
5602
5632
5823
5832
5125
5232
5235
6199
6100
6620
6750
6433
6435
6692
6795
6222
7439
7850
7653
7102
7132
7452
7133
7735
8759
8839
8693
8193
8423
8422
8852
8632
8732
8453
8832
8805
8155
9109
9829
9420
9102
9720
9623
9693
9899
9892
9423
9422
9652
9823
##1779
##1778
##7715
##1170
##1162
##1164
##1116
##1114
8025
9052
6032
6025
4052
2252
3252
8252
1522
1820
1102
1720
1122
1852
1633
1632
1832
1155
1755
1235
2690
2790
2893
2702
2153
2652
2195
2722
2453
2753
2705
2135
3859
3122
3452
3853
3722
3453
3725
3405
3533
4659
4653
4430
4800
4123
4702
4422
4852
4802
4725
4753
4625
4405
4895
4135
4225
5830
5402
5833
5802
5692
5133
5635
6159
6190
6102
6623
6852
6452
6703
6602
6723
7190
7193
7152
7422
7703
7802
7632
7692
7635
7233
8430
8609
8123
8702
8652
8825
8133
8535
9700
9150
9490
9192
9822
9453
9403
9832
9753
9125
9232
9222
##1887
##1846
##1712
##8879
##8861
##1189
##1146
4952
2935
1052
2052
7052
3052
6352
1739
1433
1153
1435
1602
1722
1453
1492
1692
1723
1635
1535
2490
2152
2792
2622
2422
2602
2822
2692
2723
2605
2825
2155
2405
2455
2232
3699
3893
3630
3622
3892
3402
3602
3732
3823
3492
3605
3832
3105
3532
3535
4839
4102
4493
4153
4603
4633
4435
4822
4632
4722
4325
5893
5432
5793
5852
5805
5725
5735
6600
6409
6122
6402
6195
6732
6722
6453
6103
6823
6492
6805
6155
6835
6233
6533
7192
7693
7433
7423
7103
7832
7225
8690
8192
8623
8792
8122
8892
8435
8822
8803
8855
8605
8755
8635
8525
9152
9702
9132
9402
9853
9855
9492
9495
9605
9825
9752
9735
9532
##8845
##8883
##8847
##8888
##8864
##7778
##7786
##1185
##1172
##8779
##8765
3952
3932
1935
9025
4032
1132
1423
1752
1725
1405
2800
2402
2833
2435
2403
2752
2133
2425
2695
3102
3702
3752
3222
3525
4693
4630
4132
4492
4825
4752
4832
4805
4835
4755
5403
5625
5105
5755
5135
6459
6709
6132
6833
6802
6803
6733
6495
6725
6705
6135
6235
7893
7432
7153
7495
7825
7753
7625
7425
7232
7532
7222
7535
8132
8433
8752
8425
8705
9622
9852
9833
9435
9133
9755
9695
9325
##8841
##8811
##8814
##7779
##7713
##7717
##1165
##1112
##1175
##1148
##8773
##8783
##8786
5935
8925
6935
6052
1822
1855
1495
1795
1735
1753
1125
2433
2855
2495
2805
2655
2525
3852
3822
3632
3803
3895
3835
3225
4453
4823
4105
4635
5433
5422
5732
5803
5453
5155
5895
5233
5535
6152
6432
6793
6825
6832
6655
6455
6325
7792
7852
7602
7652
7732
7795
7755
8735
8105
8695
8135
8325
9123
9633
9602
9803
9105
9635
##8885
##8862
##8810
##8818
##8844
##8886
##7742
##7765
##7740
##7773
##7712
##7768
##7714
##1182
##1149
##8762
##8710
##8769
##8718
##8746
##8781
##8714
4925
1035
6035
2035
7035
4025
5025
5352
1452
1732
1605
1825
1705
1532
2132
2432
2823
2733
2832
2625
2105
2125
2225
3633
3733
3795
3133
3735
3755
4152
4853
4723
4155
4425
4655
4235
5702
5195
5855
5723
5605
5752
5425
5695
6603
6735
6625
6425
6695
6225
6525
7155
7695
7325
8653
8452
8492
8655
8895
8233
8235
9722
9692
9795
9405
9135
9235
9525
##8863
##8873
##8875
##8872
##8848
##7719
##7785
##7770
##7772
##1113
##1141
##1147
##8770
##8741
##8747
##8717
9925
8035
9035
4035
1193
1895
1225
1325
2493
2725
2735
2535
3652
3855
3495
3825
3805
3655
3705
3135
3235
4452
4652
4195
4855
4533
4535
4525
5633
5733
5655
5705
5225
5325
6792
6892
6405
6125
7855
7403
7805
7655
7455
7705
7135
7235
8899
8432
8692
8725
8225
9603
9625
9835
9705
##8843
##8870
##8812
##8877
##8866
##8881
##8816
##7710
##7782
##7749
##7761
##7711
##7774
##8789
##8780
##8767
8935
4935
1025
3035
1105
1655
1525
2192
2835
2755
2635
2235
2325
3600
3425
4692
4605
4795
5452
5703
5825
5795
5455
5525
6605
6895
7720
7622
7435
7822
7803
7605
7405
7105
8402
8633
8753
9805
##8842
##7762
##7763
##7741
##7718
##7788
##7766
##7716
##7776
##1140
##1118
##8715
##8760
##8788
##8766
##8711
##1442
##7619
##8685
2925
7925
1455
3800
3422
3325
4403
4735
5835
6755
7725
8795
9432
9725
9425
9535
##8860
##8813
##8817
##8871
##7743
##7769
##7783
##7775
##7764
##7781
##1163
##8782
##8763
##8712
##8744
##8764
##8784
##8146
5925
6925
3925
2025
7025
1793
1802
1425
1835
2632
3155
4695
5405
6105
6535
7195
7125
7525
8495
8405
8125
##8889
##8882
##8887
##8846
##8884
##7760
##7780
##7748
##8719
##8785
##8713
##8772
##8716
##7865
##1440
##7466
##8485
7935
3935
3025
5035
1695
3695
3125
6635
7895
7897
8222
9155
9655
9895
##8815
##8865
##8874
##7789
##7745
##7777
##7771
##8742
##8740
##8761
##7841
##7818
##8117
##8144
##7169
##1465
##7660
##7646
##8619
##8669
##7462
##7479
##7483
##8443
##8419
##8489
##8412
9935
1925
1135
2958
3455
3635
6457
8625
9455
##8840
##8880
##8878
##7746
##7784
##8768
##7846
##7816
##8160
##8189
##8113
##8165
##8167
##8168
##7115
##7162
##7180
##1643
##1663
##1673
##1469
##1441
##7615
##7679
##7682
##7667
##8667
##7470
##7413
##7442
##8449
1625
1737
1607
1418
1138
1358
2708
4125
5628
6527
6357
8058
9887
##8849
##8869
##8876
##7767
##7744
##8743
##8775
##8748
##8787
##7885
##7873
##7812
##7867
##8143
##8179
##8182
##8175
##8118
##8164
##7142
##7175
##7166
##7146
##1640
##1669
##1485
##1462
##1463
##1468
##7643
##7662
##7663
##7669
##7641
##8662
##8612
##8680
##7473
##8472
1878
2617
2417
2827
2438
2851
2491
2037
3677
3178
3538
3328
4127
4898
4708
4227
5897
5828
5037
6107
6837
7158
7227
8835
8158
8107
8637
8491
9757
9957
##8819
##8868
##7747
##8745
##7848
##8170
##8112
##8169
##8166
##7189
##7183
##7141
##1682
##1642
##1645
##1667
##1668
##1647
##1646
##1419
##1445
##7670
##7649
##7644
##8643
##8615
##8613
##8647
##7482
##7440
##7449
##7412
##7448
##8442
##8440
##8445
##8475
##8480
##8447
1698
1677
1851
1537
2737
2127
2858
2828
2427
2727
2731
2777
3828
3238
3251
3038
4197
4458
4428
4831
4237
4537
5677
5757
5838
5527
5537
6698
6657
6737
6157
6808
6438
6618
6458
6637
6188
6328
6937
7677
7137
7128
8628
8457
8197
8131
8878
8778
8888
8227
9417
9477
9427
9121
9691
9607
9418
9178
9225
9937
9057
##7815
##7879
##7810
##7869
##7880
##7861
##7847
##7817
##7844
##8119
##8147
##7119
##7160
##7182
##7163
##7161
##7167
##7118
##7117
##1619
##1679
##1661
##1644
##1443
##1479
##1483
##1480
##1447
##1466
##7610
##7613
##7673
##7645
##7680
##7661
##7648
##8679
##8640
##8645
##8683
##8672
##8661
##8641
##7443
##7419
##7463
##7445
##7480
##7441
##8415
##8470
##8479
##8463
##8466
1657
1477
1687
1618
1727
1108
1407
1891
1651
1728
1411
1758
1887
1227
1228
1257
1938
1058
1951
2687
2757
2807
2128
2487
2158
2407
2138
2227
3737
3727
3488
3407
3697
3688
3187
3878
3778
3227
3037
3057
4617
4827
4658
4691
4607
4608
4198
4177
4187
4228
4037
4937
5698
5627
5737
5427
5807
5128
5857
5497
5121
5488
5108
5608
5777
5327
6427
6177
6881
7417
7618
7857
7488
7418
7728
7187
7887
7357
7937
7038
8737
8687
8827
8808
8137
8838
8108
8688
8358
9897
9157
9798
9457
9807
9618
9838
9481
9697
9198
9101
9871
9538
##8867
##7787
##7889
##7849
##7883
##7875
##7868
##7866
##7814
##8185
##8115
##8163
##8145
##8148
##7143
##7170
##7112
##7145
##7144
##7164
##1610
##1675
##1648
##1641
##1460
##1489
##1473
##1467
##7612
##8689
##8663
##8649
##8668
##8644
##7415
##7472
##7468
##8410
##8482
##8469
##8448
1627
1157
1798
1628
1808
1457
1137
1131
1697
1678
1198
1896
1186
1777
1778
1781
1327
1958
2657
2618
2481
2431
2607
2108
2638
2498
2697
2451
2411
2478
2177
2887
2781
2238
2221
2327
3897
3757
3487
3131
3401
3138
3837
3188
3111
3887
3777
3521
3938
4797
4627
4417
4191
4737
4687
4638
4498
4418
4791
4451
4728
4758
4538
4521
4938
4058
5477
5157
5727
5408
5498
5138
5837
5198
5177
5251
5938
6627
6197
6128
6497
6727
6607
6108
6608
6708
6478
6631
6187
6777
6878
6351
6057
6931
7617
7858
7477
7157
7808
7427
7408
7407
7637
7621
7198
7821
7188
7888
7537
7538
7327
7321
7037
8617
8677
8157
8798
8807
8438
8618
8431
8408
8638
8458
8891
8697
8731
8631
8178
8777
8771
8881
8528
8037
8957
9797
9627
9737
9827
9408
9108
9407
9498
9837
9681
9721
9428
9177
9171
9778
9888
9237
9537
9521
9037
##8749
##7819
##7870
##7813
##7863
##7840
##7845
##7811
##8142
##8173
##8172
##8161
##7179
##7113
##7140
##7172
##7147
##1685
##1615
##1689
##1649
##1672
##1461
##7640
##7675
##8648
##7485
##8462
##8465
##8468
1797
1617
1898
1427
1128
1857
1487
1838
1497
1488
1658
1671
1688
1731
1637
1478
1188
1527
1251
1037
1031
2471
2191
2707
2157
2197
2121
2658
2608
2678
2418
2701
2681
2821
2878
2888
2871
2328
2257
2251
2321
2937
3797
3191
3858
3438
3857
3691
3607
3498
3107
3637
3738
3421
3428
3888
3237
3231
3537
3228
3957
3951
4477
4157
4628
4828
4857
4497
4158
4401
4721
4777
4888
4527
4528
4328
4357
4031
5471
5858
5898
5687
5891
5151
5678
5621
5478
5751
5188
5887
5888
5881
5237
5238
5538
5358
5357
5957
5051
6617
6127
6897
6757
6628
6807
6838
6121
6658
6158
6406
6138
6758
6794
6178
6888
6237
6227
6221
6957
6951
7627
7191
7757
7437
7608
7697
7801
7428
7758
7111
7781
7258
7938
7957
8797
8417
8487
8727
8488
8837
8198
8101
8887
8527
8327
8258
8321
8057
9698
9617
9471
9858
9687
9808
9128
9437
9497
9458
9708
9187
9777
9116
9231
9528
9221
9327
9357
9257
9351
9038
9036
##7843
##7872
##7877
##8110
##8140
##8180
##8141
##7110
##7168
##1660
##1613
##1665
##1612
##1680
##1415
##1470
##1410
##1449
##1475
##1448
##7685
##7683
##7672
##7668
##8610
##8660
##8642
##8665
##8675
##7465
##7461
##7447
##8473
##8461
##8441
1417
1191
1127
1897
1827
1438
1408
1107
1701
1616
1894
1187
1181
1888
1871
1238
1538
1528
1328
1351
1051
1936
2627
2477
2798
2437
2497
2107
2401
2791
2178
2778
2527
2537
2538
2528
2236
2057
2957
3617
3627
3687
3707
3798
3457
3137
3128
3838
3481
3497
3431
3408
3108
3638
3671
3728
3491
3821
3751
3736
3871
3531
3258
3351
4698
4657
4858
4707
4798
4457
4727
4611
4407
4688
4601
4837
4701
4424
4446
4881
4327
4358
4257
4056
5797
5657
5417
5127
5798
5827
5438
5197
5487
5407
5458
5401
5821
5428
5101
5187
5778
5227
5328
5937
5958
5956
6797
6417
6898
6477
6487
6431
6611
6498
6671
6697
6738
6801
6198
6831
6776
6781
6521
6327
6258
6321
6938
6036
7657
7807
7727
7658
7691
7701
7491
7721
7478
7831
7414
7178
7778
7714
7237
7238
7527
7521
7528
7531
7328
7358
7057
7051
7958
8657
8897
8898
8477
8707
8128
8851
8738
8708
8681
8821
8124
8187
8188
8237
8521
8221
8328
8937
8938
8051
8958
9127
9137
9857
9727
9431
9608
9791
9801
9491
9411
9751
9188
9328
9258
9938
9058
9931
9951
##7882
##7842
##7165
##1670
##1683
##1482
##1413
##7665
##7647
##8670
##8682
##8673
##8646
##7460
##7489
##7467
##8460
##8483
1197
1437
1481
1431
1611
1458
1401
1708
1428
1751
1424
1221
1321
1937
2797
2898
2808
2857
2408
2611
2671
2688
2837
2728
2801
2726
2181
2881
2876
2228
2031
3657
3628
3808
3618
3121
3658
3608
3851
3678
3418
3621
3701
3681
3198
3721
3474
3101
3726
3666
3177
3181
3771
3881
3776
3786
3221
3357
3934
4487
4488
4431
4131
4678
4681
4626
4634
4178
4184
4111
4878
4771
4886
4876
4816
4238
4321
4356
4958
4936
5457
5618
5437
5431
5158
5638
5697
5107
5418
5681
5411
5436
5136
5736
5106
5806
5181
5186
5528
5531
5257
5931
6677
6707
6798
6828
6137
6407
6651
6601
6678
6701
6491
6721
6411
6136
6887
6786
6537
6528
6037
6031
7797
7898
7687
7707
7628
7838
7121
7108
7638
7891
7688
7678
7837
7751
7416
7177
7777
7871
7774
8627
8191
8858
8757
8427
8857
8497
8121
8658
8691
8407
8651
8621
8451
8411
8824
8758
8177
8171
8111
8871
8238
8538
8357
8356
8326
9628
9197
9487
9488
9158
9671
9151
9401
9688
9637
9738
9621
9451
9478
9636
9496
9856
9758
9726
9881
9227
9358
##7862
##8162
##7185
##1412
##1472
##7689
##7469
##7475
1471
1707
1757
1158
1638
1498
1608
1801
1421
1631
1604
1831
1794
1796
1177
1464
1116
1771
1881
1776
1786
1231
1258
1957
1054
2897
2628
2457
2137
2838
2488
2458
2891
2651
2621
2616
2656
2896
2404
2776
2874
2234
2226
2357
2256
2051
2038
2056
3898
3827
3807
3611
3458
3451
3478
3606
3834
3758
3794
3106
3446
3886
3527
3234
3327
3257
3937
3058
4471
4897
4757
4137
4437
4481
4121
4671
4891
4697
4621
4138
4421
4491
4616
4156
4666
4171
4887
4531
4258
4351
4057
4051
4038
4951
5707
5808
5137
5131
5708
5701
5421
5721
5894
5171
5878
5814
5231
5228
5224
5258
5256
5057
5058
5038
5034
6471
6857
6488
6691
6131
6851
6731
6418
6728
6821
6428
6751
6824
6101
6736
6634
6156
6111
6716
6231
6358
6051
6038
6958
7737
7127
7438
7131
7611
7458
7651
7731
7406
7738
7791
7681
7624
7631
7404
7826
7614
7756
7736
7456
7804
7174
7771
7886
7234
7236
7221
8471
8437
8481
8611
8498
8671
8401
8601
8418
8138
8728
8701
8428
8478
8606
8834
8704
8726
8484
8804
8666
8884
8786
8231
8537
8257
8031
8931
9898
9651
9678
9486
9421
9631
9684
9724
9654
9686
9771
9527
9228
9224
9031
9051
##8149
##8183
##7149
##7148
##1662
##8467
1858
1828
1691
1151
1621
1837
1451
1681
1491
1434
1416
1686
1154
1804
1666
1446
1531
1226
1357
1038
1934
2677
2151
2601
2637
2421
2831
2824
2496
2856
2724
2156
2187
2186
2771
2231
2351
2254
2326
2034
3698
3157
3427
3197
3437
3731
3601
3801
3411
3604
3426
3404
3756
3674
3424
3704
3654
3186
3184
3814
3784
3528
3224
3536
3358
3321
3031
3354
3051
3034
4677
4427
4128
4838
4408
4151
4651
4107
4637
4738
4478
4751
4416
4684
4676
4686
4726
4871
4814
4231
4221
4526
4957
4931
4956
5191
5658
5731
5637
5738
5451
5754
5484
5696
5116
5871
5536
5534
5351
6191
6858
6481
6408
6891
6151
6621
6791
6681
6626
6434
6474
6404
6606
6756
6126
6446
6181
6171
6778
6771
6871
6814
6234
6257
6251
6356
6058
6954
7698
7828
7457
7487
7431
7498
7671
7107
7401
7601
7138
7708
7421
7626
7411
7656
7436
7454
7706
7101
7894
7676
7726
7126
7171
7874
7716
7228
7224
7251
7254
7956
8698
8127
8607
8151
8608
8801
8706
8496
8156
8134
8181
8776
8781
8228
8251
8256
8034
8036
9828
9131
9107
9728
9701
9434
9426
9614
9734
9736
9676
9886
9774
9781
9238
9234
9524
9356
9056
##7864
##7173
##7642
##8413
1738
1721
1426
1436
1606
1706
1824
1856
1734
1676
1694
1654
1476
1836
1664
1178
1171
1176
1174
1714
1784
1521
1234
1236
1536
1057
1931
1956
2738
2486
2631
2454
2614
2101
2136
2758
2676
2634
2106
2484
2806
2804
2446
2188
2171
2176
2111
2114
2237
2521
2224
2524
2258
2054
3417
3471
3127
3477
3158
3891
3651
3626
3624
3631
3831
3436
3826
3614
3724
3686
3104
3696
3171
3114
3874
3714
3236
3524
3256
3254
3324
4618
4108
4851
4731
4801
4494
4821
4604
4856
4894
4724
4694
4654
4806
4854
4188
4176
4174
4778
4116
4781
4524
4256
4054
5617
5481
5611
5671
5851
5406
5728
5491
5831
5606
5734
5724
5676
5694
5124
5104
5126
5446
5776
5521
5221
5321
5056
5036
6687
6437
6688
6421
6494
6636
6454
6496
6674
6106
6836
6726
6796
6664
6874
6714
6256
6956
6054
7471
7827
7497
7607
7151
7616
7604
7496
7754
7194
7694
7654
7476
7104
7464
7184
7878
7114
7881
7776
7876
7884
7231
7226
7536
7257
7351
7031
7931
7056
8678
8486
8616
8751
8474
8896
8404
8831
8136
8416
8676
8476
8686
8104
8196
8126
8664
8874
8234
8531
8038
9191
9677
9438
9658
9638
9891
9851
9731
9601
9138
9494
9416
9424
9796
9186
9176
9874
9716
9251
9321
9254
9354
9324
9936
9956
9934
##7860
1807
1601
1406
1626
1821
1636
1404
1826
1756
1674
1806
1854
1134
1111
1716
1526
1356
1324
1034
2698
2691
2624
2834
2654
2476
2836
2664
2184
2116
2816
2531
2526
2536
2358
2938
2951
2036
2956
3406
3791
3486
3494
3136
3856
3416
3684
3676
3476
3796
3806
3414
3854
3664
3176
3116
3876
3534
3036
3956
4807
4406
4486
4411
4434
4636
4631
4896
4436
4614
4706
4824
4756
4736
4836
4196
4804
4716
4224
4536
4534
4326
4034
4954
4934
5691
5607
5651
5494
5434
5636
5474
5896
5404
5706
5824
5496
5416
5684
5634
5726
5196
5156
5456
5664
5178
5176
5174
5771
5876
5884
5781
5784
5816
5226
5356
5951
5936
6827
6638
6624
6616
6656
6706
6754
6856
6734
6424
6724
6196
6806
6666
6186
6174
6116
6886
6876
6784
6538
6228
6236
6526
6534
6254
6326
6354
6034
7197
7481
7851
7734
7684
7704
7106
7154
7836
7484
7664
7181
7951
7036
7936
7934
8791
8626
8636
8656
8436
8754
8734
8836
8796
8806
8414
8854
8456
8116
8784
8351
8056
8956
9707
9821
9616
9604
9896
9826
9606
9136
9834
9674
9836
9124
9156
9446
9714
9814
9784
9236
9531
9256
9054
1494
1624
1656
1454
1101
1754
1724
1106
1196
1484
1696
1886
1876
1774
1814
1056
1954
2131
2626
2428
2636
2751
2426
2826
2706
2754
2736
2894
2694
2686
2154
2104
2196
2796
2126
2134
2696
2666
2464
2884
2774
2356
2058
2934
3708
3434
3616
3656
3824
3754
3694
3124
3456
3464
3884
3716
3816
3356
3931
3936
3054
4438
4624
4426
4656
4454
4101
4834
4674
4794
4476
4104
4126
4134
4444
4874
4884
4784
4226
5601
5791
5604
5826
5756
5674
5794
5654
5154
5804
5666
5111
5886
5714
5716
5234
5524
5934
6451
6604
6426
6896
6684
6894
6704
6694
6854
6134
6114
6238
6226
6324
6934
7798
7451
7486
7434
7636
7426
7896
7136
7794
7724
7686
7196
7806
7186
7816
7524
7256
7326
7058
7354
8828
8406
8421
8721
8434
8426
8614
8756
8674
8684
8724
8444
8176
8886
8876
8714
8716
8816
8526
8524
8536
8254
8324
8936
9611
9406
9626
9474
9831
9454
9706
9894
9194
9634
9106
9694
9154
9196
9126
9444
9776
9786
9534
9326
9958
##7410
1486
1614
1136
1496
1736
1194
1704
1104
1156
1126
1414
1456
1874
1237
1224
1524
1354
1036
2198
2721
2494
2434
2474
2674
2794
2684
2194
2124
2414
2854
2786
2714
2716
2784
2534
2324
2936
2954
3151
3896
3706
3496
3194
3634
3154
3836
3196
3156
3484
3134
3444
3781
3226
3056
4808
4474
4404
4826
4194
4796
4414
4696
4186
4114
4234
4254
5801
5486
5426
5454
5614
5758
5476
5796
5414
5854
5134
5444
5114
5786
6401
6826
6614
6834
6194
6654
6686
6154
6804
6444
6464
6176
6531
6224
6536
6056
6936
7424
7796
7446
7444
7116
7786
7784
7324
7954
7054
8624
8826
8856
8794
8424
8634
8106
8696
8186
8184
8236
8226
8534
8934
9657
9656
9404
9436
9824
9754
9756
9704
9476
9104
9804
9696
9666
9664
9181
9878
9526
9226
9954
1791
1474
1834
1124
1444
1884
1256
1326
2406
2756
2416
2734
2424
2704
2456
2444
2174
2354
3734
3126
3526
3326
3958
3954
4136
4496
4734
4124
4484
4456
4464
4776
4236
4251
4324
4036
5688
5626
5624
5631
5656
5856
5834
5424
5194
5704
5464
5184
5236
5526
5254
5326
5354
5054
6436
6104
6484
6884
6816
6524
7494
7856
7674
7124
7696
7814
7356
8604
8736
8894
8694
8154
8446
8464
8174
8114
8814
8354
8951
8054
9624
9794
9806
9854
9456
9111
9114
9034
1184
1114
1534
1254
2606
2814
2931
3636
3454
3894
4606
4754
4106
4154
4181
4786
4714
5616
5686
5836
5874
5774
5031
6416
6676
6414
6456
6774
7824
7834
7634
7156
7854
7666
7176
7526
7034
8494
8454
8654
8774
8954
9484
9134
9184
9174
9876
9816
9536
1726
2604
2436
2886
3174
4704
4664
4774
5324
5954
6476
6696
6184
7134
7534
8224
9414
9464
9884
1634
3804
6486
7474
7606
8194
1121
1684
4354
6124
1816
3774
